export default function AboutMe({className}){
  return (
    <div className={className}>
      <h3>About Me</h3>
      <div>
        <div>
          <h3>사용자 경험 혁식을 통한 생산성 향상, 프론트엔드 개발자로서 실현하고 싶습니다.</h3>
          <span>
          사용자 행동 패턴을 반영한 인터페이스를 설계 및 개발하여, 사용자의 생산성을 높이는 서비스를 제공하고 싶습니다. 사용자가 데이터를 효과적으로 이해하고 활용할 수 있도록 돕는 것은 프론트엔드 개발자의 핵심 역할이라고 생각합니다. UI/UX 최적화와 데이터 시각화를 통해 서비스의 가치를 극대화하는 개발자가 되는 것이 목표입니다.

목표를 세우게 된 것은 개인 카페 운영 경험과 ‘VEMO’ 프로젝트 수행 경험을 통해 사용자 경험이 얼마나 중요한지 깊이 깨달았기 때문입니다. 카페를 운영하면서 좋은 제품만으로는 성공할 수 없으며, 고객이 브랜드를 어떻게 경험하고 느끼는지가 비즈니스 성과에 직결된다는 사실을 알게 되었습니다. 또한, 진행한 VEMO 프로젝트에서는 사용자의 학습 효율성을 높이는 UI/UX 설계와 데이터 시각화가 서비스의 가치를 얼마나 크게 향상시킬 수 있는지 직접 체감했습니다. 영상 정보를 카드 형태로 시각화하고, 유튜브 영상을 브라우저 익스텐션으로 즉시 가져올 수 있도록 구현하여 사용자의 접근성을 높였던 경험은 사용자 중심의 서비스 설계가 얼마나 중요한지를 명확히 보여주었습니다.

목표를 달성하기 위해, SW 교육기관인 ‘크래프톤 정글’에서 개발자로서의 전문성을 쌓았습니다. 단순한 프로그래밍 교육을 넘어서, 5개월 동안 주 100시간 이상 몰입하여 운영체제, 네트워크, 자료구조 등 CS 기초 지식을 심층적으로 학습했습니다. 이 과정에서 매주 새로운 팀원들과 협업하며 다양한 개발 방식을 접하고, 코드 리뷰와 토론을 통해 문제 해결 능력과 협업 역량을 강화했습니다. 이러한 경험은 사용자 중심의 문제 해결 능력을 기르는 데 결정적인 역할을 했으며, 지속적으로 스스로 성장할 수 있는 개발자로서의 기반이 되었습니다.

앞으로 저는 프론트엔드 개발자로서 사용자가 데이터를 더 쉽고 직관적으로 이해하고 활용할 수 있도록 돕는 UI/UX를 설계하고자 합니다. 사용자 행동 패턴을 분석하여 직관적인 인터페이스와 데이터 시각화를 기반으로 한 대시보드를 개발함으로써, 서비스가 사용자 친화적이고 혁신적인 방향으로 발전하는 데 기여하겠습니다. 궁극적으로, 데이터 기반 솔루션이 사용자의 생산성을 극대화할 수 있도록 지속적인 개선과 혁신을 주도하겠습니다.
          </span>
        </div>

        <div>
          <h3>저의 강점과 경험은 업무를 수행하는데 있어, 기반이 될 것입니다.</h3>
          <div>
            <div>
              <h4>[사용자 경험을 고민하고 가치를 만드는 개발자]</h4>
              <span>
              단순히 코드를 작성하는 것에 그치지 않고, 비즈니스적 관점에서 문제를 정의하고 사용자 경험을 고려한 솔루션을 제시하는 개발자로 성장해 나가겠습니다.

3년간 개인 카페를 운영하며, 고객의 니즈를 빠르게 파악하고 최적의 해결책을 제안하는 능력을 키웠습니다. 다양한 고객과의 커뮤니케이션을 통해 고객 경험을 개선한 결과, SRT 매거진 선정 ‘지역 방문 시 꼭 가봐야 할 카페 TOP 5’라는 성과를 이루었습니다. 이 경험을 통해 저는 단순한 기능 구현을 넘어, 사용자 중심의 솔루션을 설계하는 것이 중요하다는 것을 배웠습니다.

이러한 문제 해결 방식은 프로젝트에서도 적용되었습니다. 크래프톤 정글에서 학습을 진행하며, 저뿐만 아니라 다른 교육생들 또한 영상을 통해 학습하는데 어려움을 겪고 있다는 점을 발견했습니다. 이를 해결하기 위해 ‘YouTube 타임스탬프 기반의 학습 보조 서비스 VEMO’를 기획 및 개발했으며, 많은 교육생들로부터 더 효율적인 학습 환경을 제공할 수 있을 것이라는 긍정적인 피드백을 받았습니다.
              </span>
            </div>

            <div>
              <h4>[빠르게 배우고 지속적으로 성장하는 개발자]</h4>
              <span>
              단순히 새로운 기술을 익히는 것에 그치지 않고, 핵심 개념을 빠르게 습득하고 실무에 적용하며 지속적으로 성장하는 개발자로 나아가겠습니다.

크래프톤 정글에 참여했을 당시, 저는 같은 기수 중 개발 지식이 가장 적었습니다. 하지만 빠른 이해력과 적응력을 바탕으로 짧은 시간 내에 OS, 네트워크, 자료구조, 알고리즘 등 컴퓨터 공학 핵심 개념을 체계적으로 학습하며 빠르게 성장할 수 있었습니다. 이러한 학습 태도 덕분에, 초기에는 도움을 받는 입장이었지만 점차 다른 교육생들에게 직접 도움을 줄 수 있는 수준으로 발전했습니다. 그 결과, 문제 해결력과 학습 역량을 인정받아 7명만 선발되는 팀장으로 뽑혀 프로젝트를 리드할 수 있었습니다.

이처럼 주어진 환경에서 빠르게 적응하고 성장하는 능력을 갖추고 있으며, 이를 바탕으로 앞으로도 새로운 기술과 도구를 익히며 지속적으로 스스로 성장하는 개발자가 되겠습니다.
              </span>
            </div>
            <div>
              <h4>[함께 일하고 싶은 개발자]</h4>
              <span>
              단순히 기술적으로 뛰어난 것만이 아니라, 팀과 함께 성장하고, 협업을 통해 더 나은 결과를 만들어가는 개발자로 나아가겠습니다.

동료들과 CS 개념을 함께 학습하고 토론하는 과정에서, 단순한 개념 이해를 넘어 서로에게 설명하고 의견을 나누는 과정이 학습 효과를 높인다는 것을 깨달았습니다. 이 과정에서 팀원들의 강점을 배우며 서로의 지식을 공유하는 과정에서 개인의 성장 속도가 더욱 빨라질 수 있음을 경험했습니다.

제약 회사에서의 경험 또한 협업의 가치를 깊이 이해하는 계기가 되었습니다. 자유로운 의견 교류와 팀원 간의 긴밀한 협업을 통해 문제를 분석하고 해결책을 도출한 결과, 약품 생산량을 15% 증가시키는 성과를 거둘 수 있었습니다.

이러한 경험들은 저에게 소통과 협업이 최고의 성과를 만들어내는 핵심 요소임을 명확히 알려주었습니다. 앞으로도 팀과 함께 성장하고, 협업을 통해 최적의 해결책을 도출하는 개발자로가 되겠습니다.
              </span>
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}
